app/controllers/poems_controller.rb

SELECT "poems".* FROM "poems" WHERE (published = 'true')
---
	def index
		@poems = Poem.where("published = 'true'")

SELECT  "poems".* FROM "poems" WHERE (published = 'true') AND "poems"."id" = $1 LIMIT 1  [["id", 10]]
---
	def show
		@poem = Poem.find(params[:id])